/*
 * 文件说明：此文件套用大疆官方给的文件
 * 该文件实现一阶低通滤波。核心思想是把“当前采样值”和“上一次输出值”按比例混合，
 * 用较小的计算量抑制噪声，适合在电机速度、角速度、视觉角度等有高频抖动的数据上使用。
 */


/********************************** 文件包含 ************************************* */
#include "main.h"


float KK_Dynamic        = 0.5f;//一阶低通滤波系数，这里可以多设定几个系数以满足不同调用需求，函数可以根据实际情况选择系数


/**************** 一阶低通滤波说明 ****************
 * 一阶低通滤波的不足
 * 滤波系数越小，滤波结果越平稳，但是灵敏度较低；滤波系数越大，灵敏度越高，但是滤波结果越不稳定
 * 一阶滤波无法完美得兼顾灵敏度和平稳性。有时，我们只能寻找一个平衡，在可接受的灵敏度范围内取得尽可能好的平稳度
 * 参考https://www.cnblogs.com/jasonchan1202/p/8393826.html
 */

/********************************** 调试变量 ************************************* */


/***********************************************************************************
 * 函   数  名: LowPass
 * 功 能 说 明: 一阶低通滤波器
 * 形      参:float *Sample_Pre [滤波当前采样值]
 *            float *OutPut_Last [上一次的出值]
 *            char Mode [滤波系数选择]
 *
 * ****************************************************************************** */

//直接给sample值 然后last给0
float LowPass(float Sample_Pre,float OutPut_Last)
{
    float a = KK_Dynamic;//滤波系数

    float OutPut_Pre;//滤波输出值


    OutPut_Pre = a * (Sample_Pre) + (1 - a) * (OutPut_Last);  //一阶低通滤波器

    OutPut_Last = OutPut_Pre;  //更新上一次的输出值

    return OutPut_Pre;  //返回滤波后的值
}
